package com.kh.chap01_abstraction.run;

public class AbstractionRun {
	
	/*
	 * 1. 객체지향언어 : "객체"를 "지향" 하는 언어로 "객체 중심"으로 돌아간다.
	 * 
	 * 2. 객체란 ? 현실세계에 독립적으로 존재하는 모든 것들을 의미 (유형, 무형, 개념... 책상,마우스,...)
	 * 			 현실세계에서는 객체들간의 상호작용으로 돌아감(내가 물을 먹는다)
	 * 
	 * 3. 객체지향 프로그래밍 : 현실세계의 객체들간의 상호작용을 프로그래밍을 통해 가상세계로 구현하는 과정
	 * 					  (내가 쇼핑몰에 들어가서 로그인을 한다. 주체, 대상, 행위 다 객체)
	 * 
	 * 4. 구현하고자 하는 프로그램상 필요한 객체들을 만들기 위해서 (즉, 생성하기 위해서)
	 * 		: 클래스라는 틀을 먼저 만들어야 됨! (클래스란? 각 객체들의 속성들을 담아낼 수 있는 그릇같은 존재) 
	 * 									=> 이름, 나이, 주소, 폰 번호 등등을 담는 그릇
	 * 		>> 어떻게 만드는 걸까? 추상화 + 캡슐화 접목해서 만들어야한다!
	 * 
	 * 5. 추상화 과정
	 * 	1) 내가 구현하고자하는 프로그램에서 필요한 객체들을 생각해 볼 것 => 쇼핑몰
	 *  2) 그 객체들이 가지는 공통적인 속성, 기능들을 모두 추출 => 이름, 나이, 주소, 휴대폰 번호, mbti, 혈액형,...
	 * 	3) 추출한 것들을 가지고 내가 구현하고자 했던 프로그램의 "실질적인 목적"에 맞춰서 불필요한 속성, 기능들을 제거 할 것 => 혈액형, MBTI
	 * 	4) 그렇게 최종적으로 추려진 속성들을 어떤 자료형으로, 어떤 변수명으로 사용할건지 생각
	 * 	5)
	 * 
	 */

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		
	}

}
